In [2]:
import pandas as pd
import numpy as np

In [8]:
# 표의 열이라고 생각하면 쉬움
obj = pd.Series([100, 200, 300, -50])
obj

0    100
1    200
2    300
3    -50
dtype: int64

In [6]:
obj[2]

300

In [9]:
# pandas series <-> numpy array
obj.values

array([100, 200, 300, -50])

In [10]:
# series의 Index를 확인하는 방법
obj.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
# index 지정하는 방법
obj = pd.Series([100, 200, 300, -50], index=['a','b','c','z'])
obj

a    100
b    200
c    300
z    -50
dtype: int64

In [18]:
data = {'apple': 3500, 'banana': 4000, 'pineapple': 6500}
obj = pd.Series(data)
obj

apple        3500
banana       4000
pineapple    6500
dtype: int64

In [22]:
obj.index.name = 'TEST'
obj

TEST
apple        3500
banana       4000
pineapple    6500
dtype: int64

In [30]:
# DataFrame
data = {'name': ['KIM', 'LEE', 'JEONG', 'CHOI', 'LIM'],
        'year': [2011, 2012, 2013, 2014, 2015],
        'grade': ['A', 'B', 'C', 'D', 'E']
       }
df = pd.DataFrame(data)
df

    name  year grade
0    KIM  2011     A
1    LEE  2012     B
2  JEONG  2013     C
3   CHOI  2014     D
4    LIM  2015     E

In [32]:
!pwd

/Users/geoffrey/jupyter/lesson/201206

In [39]:
pd.read_csv("test_df.csv")

    name  year grade
0    kim  2011     A
1    lee  2012     F
2  jeong  2013    B+

In [49]:
# header = None
df = pd.read_csv("test_df.csv")

In [50]:
df

    name  year grade
0    kim  2011     A
1    lee  2012     F
2  jeong  2013    B+

In [51]:
# describe
df.describe()

         year
count     3.0
mean   2012.0
std       1.0
min    2011.0
25%    2011.5
50%    2012.0
75%    2012.5
max    2013.0

In [52]:
df2 = pd.read_csv("test_df.csv")

In [59]:
# DataFrame 병합
# pd.concat([df, df2], axis=0)
pd.concat([df, df2], axis=1)

    name  year grade   name  year grade
0    kim  2011     A    kim  2011     A
1    lee  2012     F    lee  2012     F
2  jeong  2013    B+  jeong  2013    B+

In [67]:
# 리스트 하나만 들어가면 인덱스 기준으로 뽑아오기
df.loc[[0,2]]

    name  year grade
0    kim  2011     A
2  jeong  2013    B+

In [68]:
# df.loc[ [index], [column] ]
df.loc[[0,2], ['name', 'grade']]

    name grade
0    kim     A
2  jeong    B+

In [72]:
# numeric index
df.iloc[:2, :2]

  name  year
0  kim  2011
1  lee  2012

In [77]:
df

    name  year grade
0    kim  2011     A
1    lee  2012     F
2  jeong  2013    B+

In [79]:
# 다른 column으로 index 지정하기 / inplace = True 특징
df.set_index('name', inplace=True)

In [81]:
df

       year grade
name
kim    2011     A
lee    2012     F
jeong  2013    B+

In [84]:
# Index 초기화
df.reset_index()

    name  year grade
0    kim  2011     A
1    lee  2012     F
2  jeong  2013    B+